<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class College extends Model
{
    /*
    |--------------------------------------------------------------------------
    | اسم الجدول
    |--------------------------------------------------------------------------
    */

    protected $table = 'colleges';


    /*
    |--------------------------------------------------------------------------
    | الحقول المسموح بحفظها
    |--------------------------------------------------------------------------
    */

    protected $fillable = [

        'college_name',

       

    ];


    /*
    |--------------------------------------------------------------------------
    | علاقة الكلية بالأقسام
    |--------------------------------------------------------------------------
    |
    | الكلية الواحدة تحتوي على عدة أقسام.
    |
    */

    public function departments()
    {

        return $this->hasMany(

            Department::class,

            'college_id',

            'id'

        );

    }


    /*
    |--------------------------------------------------------------------------
    | علاقة الكلية بالطلاب
    |--------------------------------------------------------------------------
    |
    | الكلية الواحدة تضم عدداً كبيراً من الطلاب.
    |
    */

    public function students()
    {

        return $this->hasMany(

            Student::class,

            'college_id',

            'id'

        );

    }


    /*
    |--------------------------------------------------------------------------
    | علاقة الكلية بالموظفين
    |--------------------------------------------------------------------------
    |
    | الكلية الواحدة تضم عدداً من الموظفين.
    |
    */

    public function employees()
    {

        return $this->hasMany(

            Employee::class,

            'college_id',

            'id'

        );

    }

}