<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class CourseAssignment extends Model
{
    /*
    |--------------------------------------------------------------------------
    | اسم المفتاح الأساسي
    |--------------------------------------------------------------------------
    */

    protected $primaryKey = 'assignment_id';

    /*
    |--------------------------------------------------------------------------
    | نوع المفتاح الأساسي
    |--------------------------------------------------------------------------
    */

    public $incrementing = true;

    protected $keyType = 'int';

    /*
    |--------------------------------------------------------------------------
    | الحقول المسموح بحفظها
    |--------------------------------------------------------------------------
    */

    protected $fillable = [

        'course_id',

        'department_id',

        'employee_id',

        'academic_year',

        'semester'

    ];

    /*
    |--------------------------------------------------------------------------
    | المقرر
    |--------------------------------------------------------------------------
    |
    | كل عملية توزيع مرتبطة بمقرر واحد.
    |
    */

    public function course()
    {
        return $this->belongsTo(

            Course::class,

            'course_id',

            'course_id'

        );
    }

    /*
    |--------------------------------------------------------------------------
    | القسم
    |--------------------------------------------------------------------------
    |
    | كل عملية توزيع مرتبطة بقسم واحد.
    |
    */

    public function department()
    {
        return $this->belongsTo(

            Department::class,

            'department_id',

            'id'

        );
    }

    /*
    |--------------------------------------------------------------------------
    | الموظف
    |--------------------------------------------------------------------------
    |
    | الموظف الذي يدرس هذا المقرر لهذا القسم.
    |
    */

    public function employee()
    {
        return $this->belongsTo(

            Employee::class,

            'employee_id',

            'employee_id'

        );
    }
}