<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class Course extends Model
{
    /*
    |--------------------------------------------------------------------------
    | اسم المفتاح الأساسي
    |--------------------------------------------------------------------------
    */

    protected $primaryKey = 'course_id';

    /*
    |--------------------------------------------------------------------------
    | نوع المفتاح
    |--------------------------------------------------------------------------
    */

    public $incrementing = true;

    protected $keyType = 'int';

    /*
    |--------------------------------------------------------------------------
    | الحقول المسموح بحفظها
    |--------------------------------------------------------------------------
    */

    protected $fillable = [

        'course_name',

        'level',

        'semester',

        'status'

    ];

    /*
    |--------------------------------------------------------------------------
    | الأقسام التي يدرس فيها هذا المقرر
    |--------------------------------------------------------------------------
    */

    public function departments()
    {
        return $this->belongsToMany(

            Department::class,

            'course_departments',

            'course_id',

            'department_id'

        );
    }

    /*
    |--------------------------------------------------------------------------
    | توزيع المقرر على الموظفين
    |--------------------------------------------------------------------------
    */

   public function assignments()
{
    return $this->hasMany(
        CourseAssignment::class,
        'course_id',
        'course_id'
    );
}

    /*
    |--------------------------------------------------------------------------
    | عناصر التظلمات الخاصة بالمقرر
    |--------------------------------------------------------------------------
    */

    public function appealItems()
    {
        return $this->hasMany(

            AppealItem::class,

            'course_id',

            'course_id'

        );
    }

}